Microchip-MPLAB-Harmony/touch_apps/apps/onboard_sensor/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/adc.h
/*
 * Component description for ADC
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*      file generated from device description file (ATDF) version None       */
#ifndef _PIC32CMPL10_ADC_COMPONENT_H_
#define _PIC32CMPL10_ADC_COMPONENT_H_

#include "core_cm0plus.h"

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR ADC                       */
/* ************************************************************************** */

/* -------- ADC_CTRLA : (ADC Offset: 0x00) (R/W 32) Control A -------- */
#define ADC_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (ADC_CTRLA) Control A  Reset Value */

#define ADC_CTRLA_SWRST_Pos                   _UINT32_(0)                                          /* (ADC_CTRLA) Software Reset Position */
#define ADC_CTRLA_SWRST_Msk                   (_UINT32_(0x1) << ADC_CTRLA_SWRST_Pos)               /* (ADC_CTRLA) Software Reset Mask */
#define ADC_CTRLA_SWRST(value)                (ADC_CTRLA_SWRST_Msk & (_UINT32_(value) << ADC_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the ADC_CTRLA register */
#define ADC_CTRLA_ENABLE_Pos                  _UINT32_(1)                                          /* (ADC_CTRLA) ADC Enable Position */
#define ADC_CTRLA_ENABLE_Msk                  (_UINT32_(0x1) << ADC_CTRLA_ENABLE_Pos)              /* (ADC_CTRLA) ADC Enable Mask */
#define ADC_CTRLA_ENABLE(value)               (ADC_CTRLA_ENABLE_Msk & (_UINT32_(value) << ADC_CTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the ADC_CTRLA register */
#define ADC_CTRLA_RUNSTDBY_Pos                _UINT32_(6)                                          /* (ADC_CTRLA) Run in Standby Position */
#define ADC_CTRLA_RUNSTDBY_Msk                (_UINT32_(0x1) << ADC_CTRLA_RUNSTDBY_Pos)            /* (ADC_CTRLA) Run in Standby Mask */
#define ADC_CTRLA_RUNSTDBY(value)             (ADC_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << ADC_CTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the ADC_CTRLA register */
#define ADC_CTRLA_ONDEMAND_Pos                _UINT32_(7)                                          /* (ADC_CTRLA) On Demand Position */
#define ADC_CTRLA_ONDEMAND_Msk                (_UINT32_(0x1) << ADC_CTRLA_ONDEMAND_Pos)            /* (ADC_CTRLA) On Demand Mask */
#define ADC_CTRLA_ONDEMAND(value)             (ADC_CTRLA_ONDEMAND_Msk & (_UINT32_(value) << ADC_CTRLA_ONDEMAND_Pos)) /* Assignment of value for ONDEMAND in the ADC_CTRLA register */
#define ADC_CTRLA_Msk                         _UINT32_(0x000000C3)                                 /* (ADC_CTRLA) Register Mask  */


/* -------- ADC_CTRLB : (ADC Offset: 0x04) (R/W 32) Control B -------- */
#define ADC_CTRLB_RESETVALUE                  _UINT32_(0x00)                                       /*  (ADC_CTRLB) Control B  Reset Value */

#define ADC_CTRLB_PRESCALER_Pos               _UINT32_(0)                                          /* (ADC_CTRLB) Prescaler Position */
#define ADC_CTRLB_PRESCALER_Msk               (_UINT32_(0x1F) << ADC_CTRLB_PRESCALER_Pos)          /* (ADC_CTRLB) Prescaler Mask */
#define ADC_CTRLB_PRESCALER(value)            (ADC_CTRLB_PRESCALER_Msk & (_UINT32_(value) << ADC_CTRLB_PRESCALER_Pos)) /* Assignment of value for PRESCALER in the ADC_CTRLB register */
#define   ADC_CTRLB_PRESCALER_DIV2_Val        _UINT32_(0x0)                                        /* (ADC_CTRLB) APB clock divided by 2  */
#define   ADC_CTRLB_PRESCALER_DIV3_Val        _UINT32_(0x1)                                        /* (ADC_CTRLB) APB clock divided by 3  */
#define   ADC_CTRLB_PRESCALER_DIV4_Val        _UINT32_(0x2)                                        /* (ADC_CTRLB) APB clock divided by 4  */
#define   ADC_CTRLB_PRESCALER_DIV5_Val        _UINT32_(0x3)                                        /* (ADC_CTRLB) APB clock divided by 5  */
#define   ADC_CTRLB_PRESCALER_DIV6_Val        _UINT32_(0x4)                                        /* (ADC_CTRLB) APB clock divided by 6  */
#define   ADC_CTRLB_PRESCALER_DIV7_Val        _UINT32_(0x5)                                        /* (ADC_CTRLB) APB clock divided by 7  */
#define   ADC_CTRLB_PRESCALER_DIV8_Val        _UINT32_(0x6)                                        /* (ADC_CTRLB) APB clock divided by 8  */
#define   ADC_CTRLB_PRESCALER_DIV9_Val        _UINT32_(0x7)                                        /* (ADC_CTRLB) APB clock divided by 9  */
#define   ADC_CTRLB_PRESCALER_DIV10_Val       _UINT32_(0x8)                                        /* (ADC_CTRLB) APB clock divided by 10  */
#define   ADC_CTRLB_PRESCALER_DIV11_Val       _UINT32_(0x9)                                        /* (ADC_CTRLB) APB clock divided by 11  */
#define   ADC_CTRLB_PRESCALER_DIV12_Val       _UINT32_(0xA)                                        /* (ADC_CTRLB) APB clock divided by 12  */
#define   ADC_CTRLB_PRESCALER_DIV13_Val       _UINT32_(0xB)                                        /* (ADC_CTRLB) APB clock divided by 13  */
#define   ADC_CTRLB_PRESCALER_DIV14_Val       _UINT32_(0xC)                                        /* (ADC_CTRLB) APB clock divided by 14  */
#define   ADC_CTRLB_PRESCALER_DIV15_Val       _UINT32_(0xD)                                        /* (ADC_CTRLB) APB clock divided by 15  */
#define   ADC_CTRLB_PRESCALER_DIV16_Val       _UINT32_(0xE)                                        /* (ADC_CTRLB) APB clock divided by 16  */
#define   ADC_CTRLB_PRESCALER_DIV17_Val       _UINT32_(0xF)                                        /* (ADC_CTRLB) APB clock divided by 17  */
#define   ADC_CTRLB_PRESCALER_DIV18_Val       _UINT32_(0x10)                                       /* (ADC_CTRLB) APB clock divided by 18  */
#define   ADC_CTRLB_PRESCALER_DIV19_Val       _UINT32_(0x11)                                       /* (ADC_CTRLB) APB clock divided by 19  */
#define   ADC_CTRLB_PRESCALER_DIV20_Val       _UINT32_(0x12)                                       /* (ADC_CTRLB) APB clock divided by 20  */
#define   ADC_CTRLB_PRESCALER_DIV21_Val       _UINT32_(0x13)                                       /* (ADC_CTRLB) APB clock divided by 21  */
#define   ADC_CTRLB_PRESCALER_DIV22_Val       _UINT32_(0x14)                                       /* (ADC_CTRLB) APB clock divided by 22  */
#define   ADC_CTRLB_PRESCALER_DIV23_Val       _UINT32_(0x15)                                       /* (ADC_CTRLB) APB clock divided by 23  */
#define   ADC_CTRLB_PRESCALER_DIV24_Val       _UINT32_(0x16)                                       /* (ADC_CTRLB) APB clock divided by 24  */
#define   ADC_CTRLB_PRESCALER_DIV25_Val       _UINT32_(0x17)                                       /* (ADC_CTRLB) APB clock divided by 25  */
#define   ADC_CTRLB_PRESCALER_DIV26_Val       _UINT32_(0x18)                                       /* (ADC_CTRLB) APB clock divided by 26  */
#define   ADC_CTRLB_PRESCALER_DIV27_Val       _UINT32_(0x19)                                       /* (ADC_CTRLB) APB clock divided by 27  */
#define   ADC_CTRLB_PRESCALER_DIV28_Val       _UINT32_(0x1A)                                       /* (ADC_CTRLB) APB clock divided by 28  */
#define   ADC_CTRLB_PRESCALER_DIV29_Val       _UINT32_(0x1B)                                       /* (ADC_CTRLB) APB clock divided by 29  */
#define   ADC_CTRLB_PRESCALER_DIV30_Val       _UINT32_(0x1C)                                       /* (ADC_CTRLB) APB clock divided by 30  */
#define   ADC_CTRLB_PRESCALER_DIV31_Val       _UINT32_(0x1D)                                       /* (ADC_CTRLB) APB clock divided by 31  */
#define   ADC_CTRLB_PRESCALER_DIV32_Val       _UINT32_(0x1E)                                       /* (ADC_CTRLB) APB clock divided by 32  */
#define ADC_CTRLB_PRESCALER_DIV2              (ADC_CTRLB_PRESCALER_DIV2_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 2 Position */
#define ADC_CTRLB_PRESCALER_DIV3              (ADC_CTRLB_PRESCALER_DIV3_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 3 Position */
#define ADC_CTRLB_PRESCALER_DIV4              (ADC_CTRLB_PRESCALER_DIV4_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 4 Position */
#define ADC_CTRLB_PRESCALER_DIV5              (ADC_CTRLB_PRESCALER_DIV5_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 5 Position */
#define ADC_CTRLB_PRESCALER_DIV6              (ADC_CTRLB_PRESCALER_DIV6_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 6 Position */
#define ADC_CTRLB_PRESCALER_DIV7              (ADC_CTRLB_PRESCALER_DIV7_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 7 Position */
#define ADC_CTRLB_PRESCALER_DIV8              (ADC_CTRLB_PRESCALER_DIV8_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 8 Position */
#define ADC_CTRLB_PRESCALER_DIV9              (ADC_CTRLB_PRESCALER_DIV9_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 9 Position */
#define ADC_CTRLB_PRESCALER_DIV10             (ADC_CTRLB_PRESCALER_DIV10_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 10 Position */
#define ADC_CTRLB_PRESCALER_DIV11             (ADC_CTRLB_PRESCALER_DIV11_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 11 Position */
#define ADC_CTRLB_PRESCALER_DIV12             (ADC_CTRLB_PRESCALER_DIV12_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 12 Position */
#define ADC_CTRLB_PRESCALER_DIV13             (ADC_CTRLB_PRESCALER_DIV13_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 13 Position */
#define ADC_CTRLB_PRESCALER_DIV14             (ADC_CTRLB_PRESCALER_DIV14_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 14 Position */
#define ADC_CTRLB_PRESCALER_DIV15             (ADC_CTRLB_PRESCALER_DIV15_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 15 Position */
#define ADC_CTRLB_PRESCALER_DIV16             (ADC_CTRLB_PRESCALER_DIV16_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 16 Position */
#define ADC_CTRLB_PRESCALER_DIV17             (ADC_CTRLB_PRESCALER_DIV17_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 17 Position */
#define ADC_CTRLB_PRESCALER_DIV18             (ADC_CTRLB_PRESCALER_DIV18_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 18 Position */
#define ADC_CTRLB_PRESCALER_DIV19             (ADC_CTRLB_PRESCALER_DIV19_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 19 Position */
#define ADC_CTRLB_PRESCALER_DIV20             (ADC_CTRLB_PRESCALER_DIV20_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 20 Position */
#define ADC_CTRLB_PRESCALER_DIV21             (ADC_CTRLB_PRESCALER_DIV21_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 21 Position */
#define ADC_CTRLB_PRESCALER_DIV22             (ADC_CTRLB_PRESCALER_DIV22_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 22 Position */
#define ADC_CTRLB_PRESCALER_DIV23             (ADC_CTRLB_PRESCALER_DIV23_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 23 Position */
#define ADC_CTRLB_PRESCALER_DIV24             (ADC_CTRLB_PRESCALER_DIV24_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 24 Position */
#define ADC_CTRLB_PRESCALER_DIV25             (ADC_CTRLB_PRESCALER_DIV25_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 25 Position */
#define ADC_CTRLB_PRESCALER_DIV26             (ADC_CTRLB_PRESCALER_DIV26_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 26 Position */
#define ADC_CTRLB_PRESCALER_DIV27             (ADC_CTRLB_PRESCALER_DIV27_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 27 Position */
#define ADC_CTRLB_PRESCALER_DIV28             (ADC_CTRLB_PRESCALER_DIV28_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 28 Position */
#define ADC_CTRLB_PRESCALER_DIV29             (ADC_CTRLB_PRESCALER_DIV29_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 29 Position */
#define ADC_CTRLB_PRESCALER_DIV30             (ADC_CTRLB_PRESCALER_DIV30_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 30 Position */
#define ADC_CTRLB_PRESCALER_DIV31             (ADC_CTRLB_PRESCALER_DIV31_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 31 Position */
#define ADC_CTRLB_PRESCALER_DIV32             (ADC_CTRLB_PRESCALER_DIV32_Val << ADC_CTRLB_PRESCALER_Pos) /* (ADC_CTRLB) APB clock divided by 32 Position */
#define ADC_CTRLB_TIMEBASE_Pos                _UINT32_(8)                                          /* (ADC_CTRLB) Timebase Position */
#define ADC_CTRLB_TIMEBASE_Msk                (_UINT32_(0x1F) << ADC_CTRLB_TIMEBASE_Pos)           /* (ADC_CTRLB) Timebase Mask */
#define ADC_CTRLB_TIMEBASE(value)             (ADC_CTRLB_TIMEBASE_Msk & (_UINT32_(value) << ADC_CTRLB_TIMEBASE_Pos)) /* Assignment of value for TIMEBASE in the ADC_CTRLB register */
#define ADC_CTRLB_Msk                         _UINT32_(0x00001F1F)                                 /* (ADC_CTRLB) Register Mask  */


/* -------- ADC_CTRLC : (ADC Offset: 0x08) (R/W 32) Control C -------- */
#define ADC_CTRLC_RESETVALUE                  _UINT32_(0x00)                                       /*  (ADC_CTRLC) Control C  Reset Value */

