Microchip-MPLAB-Harmony/touch_apps/apps/onboard_sensor/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/adc.h
#define ADC_CTRLC_REFSEL_Pos                  _UINT32_(0)                                          /* (ADC_CTRLC) Reference Selection Position */
#define ADC_CTRLC_REFSEL_Msk                  (_UINT32_(0x7) << ADC_CTRLC_REFSEL_Pos)              /* (ADC_CTRLC) Reference Selection Mask */
#define ADC_CTRLC_REFSEL(value)               (ADC_CTRLC_REFSEL_Msk & (_UINT32_(value) << ADC_CTRLC_REFSEL_Pos)) /* Assignment of value for REFSEL in the ADC_CTRLC register */
#define   ADC_CTRLC_REFSEL_VDD_Val            _UINT32_(0x0)                                        /* (ADC_CTRLC) VDD  */
#define   ADC_CTRLC_REFSEL_EXTVREF_Val        _UINT32_(0x2)                                        /* (ADC_CTRLC) External pin used as reference  */
#define   ADC_CTRLC_REFSEL_1V024_Val          _UINT32_(0x4)                                        /* (ADC_CTRLC) Internal reference 1.024V  */
#define   ADC_CTRLC_REFSEL_2V048_Val          _UINT32_(0x5)                                        /* (ADC_CTRLC) Internal reference 2.048V  */
#define   ADC_CTRLC_REFSEL_4V096_Val          _UINT32_(0x6)                                        /* (ADC_CTRLC) Internal reference 4.096V  */
#define   ADC_CTRLC_REFSEL_2V500_Val          _UINT32_(0x7)                                        /* (ADC_CTRLC) Internal reference 2.500V  */
#define ADC_CTRLC_REFSEL_VDD                  (ADC_CTRLC_REFSEL_VDD_Val << ADC_CTRLC_REFSEL_Pos)   /* (ADC_CTRLC) VDD Position */
#define ADC_CTRLC_REFSEL_EXTVREF              (ADC_CTRLC_REFSEL_EXTVREF_Val << ADC_CTRLC_REFSEL_Pos) /* (ADC_CTRLC) External pin used as reference Position */
#define ADC_CTRLC_REFSEL_1V024                (ADC_CTRLC_REFSEL_1V024_Val << ADC_CTRLC_REFSEL_Pos) /* (ADC_CTRLC) Internal reference 1.024V Position */
#define ADC_CTRLC_REFSEL_2V048                (ADC_CTRLC_REFSEL_2V048_Val << ADC_CTRLC_REFSEL_Pos) /* (ADC_CTRLC) Internal reference 2.048V Position */
#define ADC_CTRLC_REFSEL_4V096                (ADC_CTRLC_REFSEL_4V096_Val << ADC_CTRLC_REFSEL_Pos) /* (ADC_CTRLC) Internal reference 4.096V Position */
#define ADC_CTRLC_REFSEL_2V500                (ADC_CTRLC_REFSEL_2V500_Val << ADC_CTRLC_REFSEL_Pos) /* (ADC_CTRLC) Internal reference 2.500V Position */
#define ADC_CTRLC_Msk                         _UINT32_(0x00000007)                                 /* (ADC_CTRLC) Register Mask  */


/* -------- ADC_CTRLD : (ADC Offset: 0x0C) (R/W 32) Control D -------- */
#define ADC_CTRLD_RESETVALUE                  _UINT32_(0x00)                                       /*  (ADC_CTRLD) Control D  Reset Value */

#define ADC_CTRLD_SAMPNUM_Pos                 _UINT32_(0)                                          /* (ADC_CTRLD) Sample Accumulation Number Select Position */
#define ADC_CTRLD_SAMPNUM_Msk                 (_UINT32_(0xF) << ADC_CTRLD_SAMPNUM_Pos)             /* (ADC_CTRLD) Sample Accumulation Number Select Mask */
#define ADC_CTRLD_SAMPNUM(value)              (ADC_CTRLD_SAMPNUM_Msk & (_UINT32_(value) << ADC_CTRLD_SAMPNUM_Pos)) /* Assignment of value for SAMPNUM in the ADC_CTRLD register */
#define   ADC_CTRLD_SAMPNUM_NONE_Val          _UINT32_(0x0)                                        /* (ADC_CTRLD) No accumulation, single sample per conversion result  */
#define   ADC_CTRLD_SAMPNUM_ACC2_Val          _UINT32_(0x1)                                        /* (ADC_CTRLD) 2 samples accumulated  */
#define   ADC_CTRLD_SAMPNUM_ACC4_Val          _UINT32_(0x2)                                        /* (ADC_CTRLD) 4 samples accumulated  */
#define   ADC_CTRLD_SAMPNUM_ACC8_Val          _UINT32_(0x3)                                        /* (ADC_CTRLD) 8 samples accumulated  */
#define   ADC_CTRLD_SAMPNUM_ACC16_Val         _UINT32_(0x4)                                        /* (ADC_CTRLD) 16 samples accumulated  */
#define   ADC_CTRLD_SAMPNUM_ACC32_Val         _UINT32_(0x5)                                        /* (ADC_CTRLD) 32 samples accumulated  */
#define   ADC_CTRLD_SAMPNUM_ACC64_Val         _UINT32_(0x6)                                        /* (ADC_CTRLD) 64 samples accumulated  */
#define   ADC_CTRLD_SAMPNUM_ACC128_Val        _UINT32_(0x7)                                        /* (ADC_CTRLD) 128 samples accumulated  */
#define   ADC_CTRLD_SAMPNUM_ACC256_Val        _UINT32_(0x8)                                        /* (ADC_CTRLD) 256 samples accumulated  */
#define   ADC_CTRLD_SAMPNUM_ACC512_Val        _UINT32_(0x9)                                        /* (ADC_CTRLD) 512 samples accumulated  */
#define   ADC_CTRLD_SAMPNUM_ACC1024_Val       _UINT32_(0xA)                                        /* (ADC_CTRLD) 1024 samples accumulated  */
#define ADC_CTRLD_SAMPNUM_NONE                (ADC_CTRLD_SAMPNUM_NONE_Val << ADC_CTRLD_SAMPNUM_Pos) /* (ADC_CTRLD) No accumulation, single sample per conversion result Position */
#define ADC_CTRLD_SAMPNUM_ACC2                (ADC_CTRLD_SAMPNUM_ACC2_Val << ADC_CTRLD_SAMPNUM_Pos) /* (ADC_CTRLD) 2 samples accumulated Position */
#define ADC_CTRLD_SAMPNUM_ACC4                (ADC_CTRLD_SAMPNUM_ACC4_Val << ADC_CTRLD_SAMPNUM_Pos) /* (ADC_CTRLD) 4 samples accumulated Position */
#define ADC_CTRLD_SAMPNUM_ACC8                (ADC_CTRLD_SAMPNUM_ACC8_Val << ADC_CTRLD_SAMPNUM_Pos) /* (ADC_CTRLD) 8 samples accumulated Position */
#define ADC_CTRLD_SAMPNUM_ACC16               (ADC_CTRLD_SAMPNUM_ACC16_Val << ADC_CTRLD_SAMPNUM_Pos) /* (ADC_CTRLD) 16 samples accumulated Position */
#define ADC_CTRLD_SAMPNUM_ACC32               (ADC_CTRLD_SAMPNUM_ACC32_Val << ADC_CTRLD_SAMPNUM_Pos) /* (ADC_CTRLD) 32 samples accumulated Position */
#define ADC_CTRLD_SAMPNUM_ACC64               (ADC_CTRLD_SAMPNUM_ACC64_Val << ADC_CTRLD_SAMPNUM_Pos) /* (ADC_CTRLD) 64 samples accumulated Position */
#define ADC_CTRLD_SAMPNUM_ACC128              (ADC_CTRLD_SAMPNUM_ACC128_Val << ADC_CTRLD_SAMPNUM_Pos) /* (ADC_CTRLD) 128 samples accumulated Position */
#define ADC_CTRLD_SAMPNUM_ACC256              (ADC_CTRLD_SAMPNUM_ACC256_Val << ADC_CTRLD_SAMPNUM_Pos) /* (ADC_CTRLD) 256 samples accumulated Position */
#define ADC_CTRLD_SAMPNUM_ACC512              (ADC_CTRLD_SAMPNUM_ACC512_Val << ADC_CTRLD_SAMPNUM_Pos) /* (ADC_CTRLD) 512 samples accumulated Position */
#define ADC_CTRLD_SAMPNUM_ACC1024             (ADC_CTRLD_SAMPNUM_ACC1024_Val << ADC_CTRLD_SAMPNUM_Pos) /* (ADC_CTRLD) 1024 samples accumulated Position */
#define ADC_CTRLD_RESOLUTION_Pos              _UINT32_(8)                                          /* (ADC_CTRLD) ADC Resolution Position */
#define ADC_CTRLD_RESOLUTION_Msk              (_UINT32_(0x3) << ADC_CTRLD_RESOLUTION_Pos)          /* (ADC_CTRLD) ADC Resolution Mask */
#define ADC_CTRLD_RESOLUTION(value)           (ADC_CTRLD_RESOLUTION_Msk & (_UINT32_(value) << ADC_CTRLD_RESOLUTION_Pos)) /* Assignment of value for RESOLUTION in the ADC_CTRLD register */
#define   ADC_CTRLD_RESOLUTION_12BIT_Val      _UINT32_(0x0)                                        /* (ADC_CTRLD) 12-bit ADC Result  */
#define   ADC_CTRLD_RESOLUTION_13BIT_Val      _UINT32_(0x1)                                        /* (ADC_CTRLD) 13-bit ADC Result  */
#define   ADC_CTRLD_RESOLUTION_10BIT_Val      _UINT32_(0x2)                                        /* (ADC_CTRLD) 10-bit ADC Result  */
#define   ADC_CTRLD_RESOLUTION_8BIT_Val       _UINT32_(0x3)                                        /* (ADC_CTRLD) 8-bit ADC Result  */
#define ADC_CTRLD_RESOLUTION_12BIT            (ADC_CTRLD_RESOLUTION_12BIT_Val << ADC_CTRLD_RESOLUTION_Pos) /* (ADC_CTRLD) 12-bit ADC Result Position */
#define ADC_CTRLD_RESOLUTION_13BIT            (ADC_CTRLD_RESOLUTION_13BIT_Val << ADC_CTRLD_RESOLUTION_Pos) /* (ADC_CTRLD) 13-bit ADC Result Position */
#define ADC_CTRLD_RESOLUTION_10BIT            (ADC_CTRLD_RESOLUTION_10BIT_Val << ADC_CTRLD_RESOLUTION_Pos) /* (ADC_CTRLD) 10-bit ADC Result Position */
#define ADC_CTRLD_RESOLUTION_8BIT             (ADC_CTRLD_RESOLUTION_8BIT_Val << ADC_CTRLD_RESOLUTION_Pos) /* (ADC_CTRLD) 8-bit ADC Result Position */
#define ADC_CTRLD_SCALING_Pos                 _UINT32_(10)                                         /* (ADC_CTRLD) Result Scaling Position */
#define ADC_CTRLD_SCALING_Msk                 (_UINT32_(0x3) << ADC_CTRLD_SCALING_Pos)             /* (ADC_CTRLD) Result Scaling Mask */
#define ADC_CTRLD_SCALING(value)              (ADC_CTRLD_SCALING_Msk & (_UINT32_(value) << ADC_CTRLD_SCALING_Pos)) /* Assignment of value for SCALING in the ADC_CTRLD register */
#define   ADC_CTRLD_SCALING_NORMAL_Val        _UINT32_(0x0)                                        /* (ADC_CTRLD) The ADC output of the sample or accumulated result is right adjusted  */
#define   ADC_CTRLD_SCALING_LEFTADJ_Val       _UINT32_(0x1)                                        /* (ADC_CTRLD) The ADC output is left adjusted  */
#define   ADC_CTRLD_SCALING_AVERAGE_Val       _UINT32_(0x2)                                        /* (ADC_CTRLD) The accumulated ADC result is averaged and right adjusted  */
#define ADC_CTRLD_SCALING_NORMAL              (ADC_CTRLD_SCALING_NORMAL_Val << ADC_CTRLD_SCALING_Pos) /* (ADC_CTRLD) The ADC output of the sample or accumulated result is right adjusted Position */
#define ADC_CTRLD_SCALING_LEFTADJ             (ADC_CTRLD_SCALING_LEFTADJ_Val << ADC_CTRLD_SCALING_Pos) /* (ADC_CTRLD) The ADC output is left adjusted Position */
#define ADC_CTRLD_SCALING_AVERAGE             (ADC_CTRLD_SCALING_AVERAGE_Val << ADC_CTRLD_SCALING_Pos) /* (ADC_CTRLD) The accumulated ADC result is averaged and right adjusted Position */
#define ADC_CTRLD_FREERUN_Pos                 _UINT32_(12)                                         /* (ADC_CTRLD) Free-Running Position */
#define ADC_CTRLD_FREERUN_Msk                 (_UINT32_(0x1) << ADC_CTRLD_FREERUN_Pos)             /* (ADC_CTRLD) Free-Running Mask */
#define ADC_CTRLD_FREERUN(value)              (ADC_CTRLD_FREERUN_Msk & (_UINT32_(value) << ADC_CTRLD_FREERUN_Pos)) /* Assignment of value for FREERUN in the ADC_CTRLD register */
#define ADC_CTRLD_CHOPPING_Pos                _UINT32_(13)                                         /* (ADC_CTRLD) Sign Chopping Position */
#define ADC_CTRLD_CHOPPING_Msk                (_UINT32_(0x1) << ADC_CTRLD_CHOPPING_Pos)            /* (ADC_CTRLD) Sign Chopping Mask */
#define ADC_CTRLD_CHOPPING(value)             (ADC_CTRLD_CHOPPING_Msk & (_UINT32_(value) << ADC_CTRLD_CHOPPING_Pos)) /* Assignment of value for CHOPPING in the ADC_CTRLD register */
#define ADC_CTRLD_FILTER_Pos                  _UINT32_(14)                                         /* (ADC_CTRLD) Low-Pass Filter Position */
#define ADC_CTRLD_FILTER_Msk                  (_UINT32_(0x1) << ADC_CTRLD_FILTER_Pos)              /* (ADC_CTRLD) Low-Pass Filter Mask */
#define ADC_CTRLD_FILTER(value)               (ADC_CTRLD_FILTER_Msk & (_UINT32_(value) << ADC_CTRLD_FILTER_Pos)) /* Assignment of value for FILTER in the ADC_CTRLD register */
#define ADC_CTRLD_VPD_Pos                     _UINT32_(16)                                         /* (ADC_CTRLD) Voltage Pump Disable Position */
#define ADC_CTRLD_VPD_Msk                     (_UINT32_(0x1) << ADC_CTRLD_VPD_Pos)                 /* (ADC_CTRLD) Voltage Pump Disable Mask */
#define ADC_CTRLD_VPD(value)                  (ADC_CTRLD_VPD_Msk & (_UINT32_(value) << ADC_CTRLD_VPD_Pos)) /* Assignment of value for VPD in the ADC_CTRLD register */
#define ADC_CTRLD_Msk                         _UINT32_(0x00017F0F)                                 /* (ADC_CTRLD) Register Mask  */


/* -------- ADC_CTRLE : (ADC Offset: 0x10) (R/W 32) Control E -------- */
#define ADC_CTRLE_RESETVALUE                  _UINT32_(0x00)                                       /*  (ADC_CTRLE) Control E  Reset Value */

