Microchip-MPLAB-Harmony/touch_apps/apps/onboard_sensor/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/adc.h
#define ADC_CTRLE_SAMPLEN_Pos                 _UINT32_(0)                                          /* (ADC_CTRLE) Sample Length Position */
#define ADC_CTRLE_SAMPLEN_Msk                 (_UINT32_(0xFF) << ADC_CTRLE_SAMPLEN_Pos)            /* (ADC_CTRLE) Sample Length Mask */
#define ADC_CTRLE_SAMPLEN(value)              (ADC_CTRLE_SAMPLEN_Msk & (_UINT32_(value) << ADC_CTRLE_SAMPLEN_Pos)) /* Assignment of value for SAMPLEN in the ADC_CTRLE register */
#define ADC_CTRLE_Msk                         _UINT32_(0x000000FF)                                 /* (ADC_CTRLE) Register Mask  */


/* -------- ADC_WINCTRL : (ADC Offset: 0x1C) (R/W 32) Window Control -------- */
#define ADC_WINCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_WINCTRL) Window Control  Reset Value */

#define ADC_WINCTRL_WINMODE_Pos               _UINT32_(0)                                          /* (ADC_WINCTRL) Window Comparator Mode Position */
#define ADC_WINCTRL_WINMODE_Msk               (_UINT32_(0x7) << ADC_WINCTRL_WINMODE_Pos)           /* (ADC_WINCTRL) Window Comparator Mode Mask */
#define ADC_WINCTRL_WINMODE(value)            (ADC_WINCTRL_WINMODE_Msk & (_UINT32_(value) << ADC_WINCTRL_WINMODE_Pos)) /* Assignment of value for WINMODE in the ADC_WINCTRL register */
#define   ADC_WINCTRL_WINMODE_NONE_Val        _UINT32_(0x0)                                        /* (ADC_WINCTRL) No Window Comparison  */
#define   ADC_WINCTRL_WINMODE_BELOW_Val       _UINT32_(0x1)                                        /* (ADC_WINCTRL) OUTPUT 'less than' WINLT  */
#define   ADC_WINCTRL_WINMODE_ABOVE_Val       _UINT32_(0x2)                                        /* (ADC_WINCTRL) OUTPUT 'greater than' WINHT  */
#define   ADC_WINCTRL_WINMODE_INSIDE_Val      _UINT32_(0x3)                                        /* (ADC_WINCTRL) WINLT 'less than' OUTPUT 'less than' WINHT  */
#define   ADC_WINCTRL_WINMODE_OUTSIDE_Val     _UINT32_(0x4)                                        /* (ADC_WINCTRL) OUTPUT 'less than' WINLT or OUTPUT 'greater than'WINHT  */
#define ADC_WINCTRL_WINMODE_NONE              (ADC_WINCTRL_WINMODE_NONE_Val << ADC_WINCTRL_WINMODE_Pos) /* (ADC_WINCTRL) No Window Comparison Position */
#define ADC_WINCTRL_WINMODE_BELOW             (ADC_WINCTRL_WINMODE_BELOW_Val << ADC_WINCTRL_WINMODE_Pos) /* (ADC_WINCTRL) OUTPUT 'less than' WINLT Position */
#define ADC_WINCTRL_WINMODE_ABOVE             (ADC_WINCTRL_WINMODE_ABOVE_Val << ADC_WINCTRL_WINMODE_Pos) /* (ADC_WINCTRL) OUTPUT 'greater than' WINHT Position */
#define ADC_WINCTRL_WINMODE_INSIDE            (ADC_WINCTRL_WINMODE_INSIDE_Val << ADC_WINCTRL_WINMODE_Pos) /* (ADC_WINCTRL) WINLT 'less than' OUTPUT 'less than' WINHT Position */
#define ADC_WINCTRL_WINMODE_OUTSIDE           (ADC_WINCTRL_WINMODE_OUTSIDE_Val << ADC_WINCTRL_WINMODE_Pos) /* (ADC_WINCTRL) OUTPUT 'less than' WINLT or OUTPUT 'greater than'WINHT Position */
#define ADC_WINCTRL_WINSRC_Pos                _UINT32_(3)                                          /* (ADC_WINCTRL) Window Mode Source Position */
#define ADC_WINCTRL_WINSRC_Msk                (_UINT32_(0x1) << ADC_WINCTRL_WINSRC_Pos)            /* (ADC_WINCTRL) Window Mode Source Mask */
#define ADC_WINCTRL_WINSRC(value)             (ADC_WINCTRL_WINSRC_Msk & (_UINT32_(value) << ADC_WINCTRL_WINSRC_Pos)) /* Assignment of value for WINSRC in the ADC_WINCTRL register */
#define   ADC_WINCTRL_WINSRC_RESULT_Val       _UINT32_(0x0)                                        /* (ADC_WINCTRL) Use RESULT[15:0] as Window Comparator source  */
#define   ADC_WINCTRL_WINSRC_SAMPLE_Val       _UINT32_(0x1)                                        /* (ADC_WINCTRL) Use SAMPLE[15:0] as Window Comparator source  */
#define ADC_WINCTRL_WINSRC_RESULT             (ADC_WINCTRL_WINSRC_RESULT_Val << ADC_WINCTRL_WINSRC_Pos) /* (ADC_WINCTRL) Use RESULT[15:0] as Window Comparator source Position */
#define ADC_WINCTRL_WINSRC_SAMPLE             (ADC_WINCTRL_WINSRC_SAMPLE_Val << ADC_WINCTRL_WINSRC_Pos) /* (ADC_WINCTRL) Use SAMPLE[15:0] as Window Comparator source Position */
#define ADC_WINCTRL_Msk                       _UINT32_(0x0000000F)                                 /* (ADC_WINCTRL) Register Mask  */


/* -------- ADC_WINLT : (ADC Offset: 0x20) (R/W 32) Window Low Threshold -------- */
#define ADC_WINLT_RESETVALUE                  _UINT32_(0x00)                                       /*  (ADC_WINLT) Window Low Threshold  Reset Value */

#define ADC_WINLT_WINLT_Pos                   _UINT32_(0)                                          /* (ADC_WINLT) Window Low Threshold Position */
#define ADC_WINLT_WINLT_Msk                   (_UINT32_(0xFFFF) << ADC_WINLT_WINLT_Pos)            /* (ADC_WINLT) Window Low Threshold Mask */
#define ADC_WINLT_WINLT(value)                (ADC_WINLT_WINLT_Msk & (_UINT32_(value) << ADC_WINLT_WINLT_Pos)) /* Assignment of value for WINLT in the ADC_WINLT register */
#define ADC_WINLT_Msk                         _UINT32_(0x0000FFFF)                                 /* (ADC_WINLT) Register Mask  */


/* -------- ADC_WINHT : (ADC Offset: 0x24) (R/W 32) Window High Threshold -------- */
#define ADC_WINHT_RESETVALUE                  _UINT32_(0x00)                                       /*  (ADC_WINHT) Window High Threshold  Reset Value */

#define ADC_WINHT_WINHT_Pos                   _UINT32_(0)                                          /* (ADC_WINHT) Window High Threshold Position */
#define ADC_WINHT_WINHT_Msk                   (_UINT32_(0xFFFF) << ADC_WINHT_WINHT_Pos)            /* (ADC_WINHT) Window High Threshold Mask */
#define ADC_WINHT_WINHT(value)                (ADC_WINHT_WINHT_Msk & (_UINT32_(value) << ADC_WINHT_WINHT_Pos)) /* Assignment of value for WINHT in the ADC_WINHT register */
#define ADC_WINHT_Msk                         _UINT32_(0x0000FFFF)                                 /* (ADC_WINHT) Register Mask  */


/* -------- ADC_INPUTCTRL : (ADC Offset: 0x28) (R/W 32) Input Multiplexer Control -------- */
#define ADC_INPUTCTRL_RESETVALUE              _UINT32_(0x00)                                       /*  (ADC_INPUTCTRL) Input Multiplexer Control  Reset Value */

