Microchip-MPLAB-Harmony/touch_apps/apps/onboard_sensor/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/adc.h
#define ADC_INPUTCTRL_MUXNEG_Pos              _UINT32_(0)                                          /* (ADC_INPUTCTRL) Negative Input Multiplexer Position */
#define ADC_INPUTCTRL_MUXNEG_Msk              (_UINT32_(0x7F) << ADC_INPUTCTRL_MUXNEG_Pos)         /* (ADC_INPUTCTRL) Negative Input Multiplexer Mask */
#define ADC_INPUTCTRL_MUXNEG(value)           (ADC_INPUTCTRL_MUXNEG_Msk & (_UINT32_(value) << ADC_INPUTCTRL_MUXNEG_Pos)) /* Assignment of value for MUXNEG in the ADC_INPUTCTRL register */
#define   ADC_INPUTCTRL_MUXNEG_AIN2_Val       _UINT32_(0x2)                                        /* (ADC_INPUTCTRL) ADC AIN2 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN3_Val       _UINT32_(0x3)                                        /* (ADC_INPUTCTRL) ADC AIN3 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN4_Val       _UINT32_(0x4)                                        /* (ADC_INPUTCTRL) ADC AIN4 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN5_Val       _UINT32_(0x5)                                        /* (ADC_INPUTCTRL) ADC AIN5 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN6_Val       _UINT32_(0x6)                                        /* (ADC_INPUTCTRL) ADC AIN6 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN7_Val       _UINT32_(0x7)                                        /* (ADC_INPUTCTRL) ADC AIN7 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN16_Val      _UINT32_(0x10)                                       /* (ADC_INPUTCTRL) ADC AIN16 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN17_Val      _UINT32_(0x11)                                       /* (ADC_INPUTCTRL) ADC AIN17 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN18_Val      _UINT32_(0x12)                                       /* (ADC_INPUTCTRL) ADC AIN18 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN19_Val      _UINT32_(0x13)                                       /* (ADC_INPUTCTRL) ADC AIN19 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN20_Val      _UINT32_(0x14)                                       /* (ADC_INPUTCTRL) ADC AIN20 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN21_Val      _UINT32_(0x15)                                       /* (ADC_INPUTCTRL) ADC AIN21 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN22_Val      _UINT32_(0x16)                                       /* (ADC_INPUTCTRL) ADC AIN22 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN23_Val      _UINT32_(0x17)                                       /* (ADC_INPUTCTRL) ADC AIN23 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN24_Val      _UINT32_(0x18)                                       /* (ADC_INPUTCTRL) ADC AIN24 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN25_Val      _UINT32_(0x19)                                       /* (ADC_INPUTCTRL) ADC AIN25 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN26_Val      _UINT32_(0x1A)                                       /* (ADC_INPUTCTRL) ADC AIN26 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN27_Val      _UINT32_(0x1B)                                       /* (ADC_INPUTCTRL) ADC AIN27 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN28_Val      _UINT32_(0x1C)                                       /* (ADC_INPUTCTRL) ADC AIN28 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN29_Val      _UINT32_(0x1D)                                       /* (ADC_INPUTCTRL) ADC AIN29 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN31_Val      _UINT32_(0x1F)                                       /* (ADC_INPUTCTRL) ADC AIN31 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN40_Val      _UINT32_(0x28)                                       /* (ADC_INPUTCTRL) ADC AIN40 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN41_Val      _UINT32_(0x29)                                       /* (ADC_INPUTCTRL) ADC AIN41 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN42_Val      _UINT32_(0x2A)                                       /* (ADC_INPUTCTRL) ADC AIN42 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN43_Val      _UINT32_(0x2B)                                       /* (ADC_INPUTCTRL) ADC AIN43 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN44_Val      _UINT32_(0x2C)                                       /* (ADC_INPUTCTRL) ADC AIN44 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN45_Val      _UINT32_(0x2D)                                       /* (ADC_INPUTCTRL) ADC AIN45 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN46_Val      _UINT32_(0x2E)                                       /* (ADC_INPUTCTRL) ADC AIN46 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_AIN47_Val      _UINT32_(0x2F)                                       /* (ADC_INPUTCTRL) ADC AIN47 Pin  */
#define   ADC_INPUTCTRL_MUXNEG_GND_Val        _UINT32_(0x60)                                       /* (ADC_INPUTCTRL) Analog Ground  */
#define   ADC_INPUTCTRL_MUXNEG_VREFP_Val      _UINT32_(0x61)                                       /* (ADC_INPUTCTRL) Positive Reference  */
#define ADC_INPUTCTRL_MUXNEG_AIN2             (ADC_INPUTCTRL_MUXNEG_AIN2_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN2 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN3             (ADC_INPUTCTRL_MUXNEG_AIN3_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN3 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN4             (ADC_INPUTCTRL_MUXNEG_AIN4_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN4 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN5             (ADC_INPUTCTRL_MUXNEG_AIN5_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN5 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN6             (ADC_INPUTCTRL_MUXNEG_AIN6_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN6 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN7             (ADC_INPUTCTRL_MUXNEG_AIN7_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN7 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN16            (ADC_INPUTCTRL_MUXNEG_AIN16_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN16 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN17            (ADC_INPUTCTRL_MUXNEG_AIN17_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN17 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN18            (ADC_INPUTCTRL_MUXNEG_AIN18_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN18 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN19            (ADC_INPUTCTRL_MUXNEG_AIN19_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN19 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN20            (ADC_INPUTCTRL_MUXNEG_AIN20_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN20 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN21            (ADC_INPUTCTRL_MUXNEG_AIN21_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN21 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN22            (ADC_INPUTCTRL_MUXNEG_AIN22_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN22 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN23            (ADC_INPUTCTRL_MUXNEG_AIN23_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN23 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN24            (ADC_INPUTCTRL_MUXNEG_AIN24_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN24 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN25            (ADC_INPUTCTRL_MUXNEG_AIN25_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN25 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN26            (ADC_INPUTCTRL_MUXNEG_AIN26_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN26 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN27            (ADC_INPUTCTRL_MUXNEG_AIN27_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN27 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN28            (ADC_INPUTCTRL_MUXNEG_AIN28_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN28 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN29            (ADC_INPUTCTRL_MUXNEG_AIN29_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN29 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN31            (ADC_INPUTCTRL_MUXNEG_AIN31_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN31 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN40            (ADC_INPUTCTRL_MUXNEG_AIN40_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN40 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN41            (ADC_INPUTCTRL_MUXNEG_AIN41_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN41 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN42            (ADC_INPUTCTRL_MUXNEG_AIN42_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN42 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN43            (ADC_INPUTCTRL_MUXNEG_AIN43_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN43 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN44            (ADC_INPUTCTRL_MUXNEG_AIN44_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN44 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN45            (ADC_INPUTCTRL_MUXNEG_AIN45_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN45 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN46            (ADC_INPUTCTRL_MUXNEG_AIN46_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN46 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_AIN47            (ADC_INPUTCTRL_MUXNEG_AIN47_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) ADC AIN47 Pin Position */
#define ADC_INPUTCTRL_MUXNEG_GND              (ADC_INPUTCTRL_MUXNEG_GND_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) Analog Ground Position */
#define ADC_INPUTCTRL_MUXNEG_VREFP            (ADC_INPUTCTRL_MUXNEG_VREFP_Val << ADC_INPUTCTRL_MUXNEG_Pos) /* (ADC_INPUTCTRL) Positive Reference Position */
#define ADC_INPUTCTRL_MUXPOS_Pos              _UINT32_(8)                                          /* (ADC_INPUTCTRL) Positive Input Multiplexer Position */
#define ADC_INPUTCTRL_MUXPOS_Msk              (_UINT32_(0x7F) << ADC_INPUTCTRL_MUXPOS_Pos)         /* (ADC_INPUTCTRL) Positive Input Multiplexer Mask */
#define ADC_INPUTCTRL_MUXPOS(value)           (ADC_INPUTCTRL_MUXPOS_Msk & (_UINT32_(value) << ADC_INPUTCTRL_MUXPOS_Pos)) /* Assignment of value for MUXPOS in the ADC_INPUTCTRL register */
#define   ADC_INPUTCTRL_MUXPOS_AIN2_Val       _UINT32_(0x2)                                        /* (ADC_INPUTCTRL) ADC AIN2 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN3_Val       _UINT32_(0x3)                                        /* (ADC_INPUTCTRL) ADC AIN3 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN4_Val       _UINT32_(0x4)                                        /* (ADC_INPUTCTRL) ADC AIN4 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN5_Val       _UINT32_(0x5)                                        /* (ADC_INPUTCTRL) ADC AIN5 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN6_Val       _UINT32_(0x6)                                        /* (ADC_INPUTCTRL) ADC AIN6 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN7_Val       _UINT32_(0x7)                                        /* (ADC_INPUTCTRL) ADC AIN7 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN16_Val      _UINT32_(0x10)                                       /* (ADC_INPUTCTRL) ADC AIN16 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN17_Val      _UINT32_(0x11)                                       /* (ADC_INPUTCTRL) ADC AIN17 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN18_Val      _UINT32_(0x12)                                       /* (ADC_INPUTCTRL) ADC AIN18 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN19_Val      _UINT32_(0x13)                                       /* (ADC_INPUTCTRL) ADC AIN19 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN20_Val      _UINT32_(0x14)                                       /* (ADC_INPUTCTRL) ADC AIN20 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN21_Val      _UINT32_(0x15)                                       /* (ADC_INPUTCTRL) ADC AIN21 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN22_Val      _UINT32_(0x16)                                       /* (ADC_INPUTCTRL) ADC AIN22 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN23_Val      _UINT32_(0x17)                                       /* (ADC_INPUTCTRL) ADC AIN23 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN24_Val      _UINT32_(0x18)                                       /* (ADC_INPUTCTRL) ADC AIN24 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN25_Val      _UINT32_(0x19)                                       /* (ADC_INPUTCTRL) ADC AIN25 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN26_Val      _UINT32_(0x1A)                                       /* (ADC_INPUTCTRL) ADC AIN26 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN27_Val      _UINT32_(0x1B)                                       /* (ADC_INPUTCTRL) ADC AIN27 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN28_Val      _UINT32_(0x1C)                                       /* (ADC_INPUTCTRL) ADC AIN28 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN29_Val      _UINT32_(0x1D)                                       /* (ADC_INPUTCTRL) ADC AIN29 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN31_Val      _UINT32_(0x1F)                                       /* (ADC_INPUTCTRL) ADC AIN31 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN40_Val      _UINT32_(0x28)                                       /* (ADC_INPUTCTRL) ADC AIN40 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN41_Val      _UINT32_(0x29)                                       /* (ADC_INPUTCTRL) ADC AIN41 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN42_Val      _UINT32_(0x2A)                                       /* (ADC_INPUTCTRL) ADC AIN42 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN43_Val      _UINT32_(0x2B)                                       /* (ADC_INPUTCTRL) ADC AIN43 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN44_Val      _UINT32_(0x2C)                                       /* (ADC_INPUTCTRL) ADC AIN44 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN45_Val      _UINT32_(0x2D)                                       /* (ADC_INPUTCTRL) ADC AIN45 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN46_Val      _UINT32_(0x2E)                                       /* (ADC_INPUTCTRL) ADC AIN46 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_AIN47_Val      _UINT32_(0x2F)                                       /* (ADC_INPUTCTRL) ADC AIN47 Pin  */
#define   ADC_INPUTCTRL_MUXPOS_GND_Val        _UINT32_(0x60)                                       /* (ADC_INPUTCTRL) Analog Ground  */
#define   ADC_INPUTCTRL_MUXPOS_VDDCOREDIV4_Val _UINT32_(0x61)                                       /* (ADC_INPUTCTRL) 1/4 Scaled Core Supply  */
#define   ADC_INPUTCTRL_MUXPOS_TEMPSENSE_Val  _UINT32_(0x62)                                       /* (ADC_INPUTCTRL) Temperature Sensor  */
#define   ADC_INPUTCTRL_MUXPOS_VDDIODIV10_Val _UINT32_(0x64)                                       /* (ADC_INPUTCTRL) 1/10 Scaled VDDIO Supply  */
#define   ADC_INPUTCTRL_MUXPOS_VDDIO2DIV10_Val _UINT32_(0x65)                                       /* (ADC_INPUTCTRL) 1/10 Scaled VDDIO2 Supply  */
#define   ADC_INPUTCTRL_MUXPOS_ACVREFSCALE0_Val _UINT32_(0x69)                                       /* (ADC_INPUTCTRL) Output from AC VREFSCALE0  */
#define   ADC_INPUTCTRL_MUXPOS_ACVREFSCALE1_Val _UINT32_(0x6A)                                       /* (ADC_INPUTCTRL) Output from AC VREFSCALE1  */
#define   ADC_INPUTCTRL_MUXPOS_TESTBUF_Val    _UINT32_(0x70)                                       /* (ADC_INPUTCTRL) Test Buffer  */
#define   ADC_INPUTCTRL_MUXPOS_PTC_Val        _UINT32_(0x7E)                                       /* (ADC_INPUTCTRL) PTC  */
#define ADC_INPUTCTRL_MUXPOS_AIN2             (ADC_INPUTCTRL_MUXPOS_AIN2_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN2 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN3             (ADC_INPUTCTRL_MUXPOS_AIN3_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN3 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN4             (ADC_INPUTCTRL_MUXPOS_AIN4_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN4 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN5             (ADC_INPUTCTRL_MUXPOS_AIN5_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN5 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN6             (ADC_INPUTCTRL_MUXPOS_AIN6_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN6 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN7             (ADC_INPUTCTRL_MUXPOS_AIN7_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN7 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN16            (ADC_INPUTCTRL_MUXPOS_AIN16_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN16 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN17            (ADC_INPUTCTRL_MUXPOS_AIN17_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN17 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN18            (ADC_INPUTCTRL_MUXPOS_AIN18_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN18 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN19            (ADC_INPUTCTRL_MUXPOS_AIN19_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN19 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN20            (ADC_INPUTCTRL_MUXPOS_AIN20_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN20 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN21            (ADC_INPUTCTRL_MUXPOS_AIN21_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN21 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN22            (ADC_INPUTCTRL_MUXPOS_AIN22_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN22 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN23            (ADC_INPUTCTRL_MUXPOS_AIN23_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN23 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN24            (ADC_INPUTCTRL_MUXPOS_AIN24_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN24 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN25            (ADC_INPUTCTRL_MUXPOS_AIN25_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN25 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN26            (ADC_INPUTCTRL_MUXPOS_AIN26_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN26 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN27            (ADC_INPUTCTRL_MUXPOS_AIN27_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN27 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN28            (ADC_INPUTCTRL_MUXPOS_AIN28_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN28 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN29            (ADC_INPUTCTRL_MUXPOS_AIN29_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN29 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN31            (ADC_INPUTCTRL_MUXPOS_AIN31_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN31 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN40            (ADC_INPUTCTRL_MUXPOS_AIN40_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN40 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN41            (ADC_INPUTCTRL_MUXPOS_AIN41_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN41 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN42            (ADC_INPUTCTRL_MUXPOS_AIN42_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN42 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN43            (ADC_INPUTCTRL_MUXPOS_AIN43_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN43 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN44            (ADC_INPUTCTRL_MUXPOS_AIN44_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN44 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN45            (ADC_INPUTCTRL_MUXPOS_AIN45_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN45 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN46            (ADC_INPUTCTRL_MUXPOS_AIN46_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN46 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_AIN47            (ADC_INPUTCTRL_MUXPOS_AIN47_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) ADC AIN47 Pin Position */
#define ADC_INPUTCTRL_MUXPOS_GND              (ADC_INPUTCTRL_MUXPOS_GND_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) Analog Ground Position */
#define ADC_INPUTCTRL_MUXPOS_VDDCOREDIV4      (ADC_INPUTCTRL_MUXPOS_VDDCOREDIV4_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) 1/4 Scaled Core Supply Position */
#define ADC_INPUTCTRL_MUXPOS_TEMPSENSE        (ADC_INPUTCTRL_MUXPOS_TEMPSENSE_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) Temperature Sensor Position */
#define ADC_INPUTCTRL_MUXPOS_VDDIODIV10       (ADC_INPUTCTRL_MUXPOS_VDDIODIV10_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) 1/10 Scaled VDDIO Supply Position */
#define ADC_INPUTCTRL_MUXPOS_VDDIO2DIV10      (ADC_INPUTCTRL_MUXPOS_VDDIO2DIV10_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) 1/10 Scaled VDDIO2 Supply Position */
#define ADC_INPUTCTRL_MUXPOS_ACVREFSCALE0     (ADC_INPUTCTRL_MUXPOS_ACVREFSCALE0_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) Output from AC VREFSCALE0 Position */
#define ADC_INPUTCTRL_MUXPOS_ACVREFSCALE1     (ADC_INPUTCTRL_MUXPOS_ACVREFSCALE1_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) Output from AC VREFSCALE1 Position */
#define ADC_INPUTCTRL_MUXPOS_TESTBUF          (ADC_INPUTCTRL_MUXPOS_TESTBUF_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) Test Buffer Position */
#define ADC_INPUTCTRL_MUXPOS_PTC              (ADC_INPUTCTRL_MUXPOS_PTC_Val << ADC_INPUTCTRL_MUXPOS_Pos) /* (ADC_INPUTCTRL) PTC Position */
#define ADC_INPUTCTRL_Msk                     _UINT32_(0x00007F7F)                                 /* (ADC_INPUTCTRL) Register Mask  */


/* -------- ADC_EVCTRL : (ADC Offset: 0x2C) (R/W 32) Event Control -------- */
#define ADC_EVCTRL_RESETVALUE                 _UINT32_(0x00)                                       /*  (ADC_EVCTRL) Event Control  Reset Value */

#define ADC_EVCTRL_STARTEI_Pos                _UINT32_(0)                                          /* (ADC_EVCTRL) Conversion Start Event Input Enable Position */
#define ADC_EVCTRL_STARTEI_Msk                (_UINT32_(0x1) << ADC_EVCTRL_STARTEI_Pos)            /* (ADC_EVCTRL) Conversion Start Event Input Enable Mask */
#define ADC_EVCTRL_STARTEI(value)             (ADC_EVCTRL_STARTEI_Msk & (_UINT32_(value) << ADC_EVCTRL_STARTEI_Pos)) /* Assignment of value for STARTEI in the ADC_EVCTRL register */
#define ADC_EVCTRL_STARTINV_Pos               _UINT32_(4)                                          /* (ADC_EVCTRL) Conversion Start Event Input Invert Position */
#define ADC_EVCTRL_STARTINV_Msk               (_UINT32_(0x1) << ADC_EVCTRL_STARTINV_Pos)           /* (ADC_EVCTRL) Conversion Start Event Input Invert Mask */
#define ADC_EVCTRL_STARTINV(value)            (ADC_EVCTRL_STARTINV_Msk & (_UINT32_(value) << ADC_EVCTRL_STARTINV_Pos)) /* Assignment of value for STARTINV in the ADC_EVCTRL register */
#define ADC_EVCTRL_RESRDYEO_Pos               _UINT32_(8)                                          /* (ADC_EVCTRL) Result Ready Event Output Enable Position */
#define ADC_EVCTRL_RESRDYEO_Msk               (_UINT32_(0x1) << ADC_EVCTRL_RESRDYEO_Pos)           /* (ADC_EVCTRL) Result Ready Event Output Enable Mask */
#define ADC_EVCTRL_RESRDYEO(value)            (ADC_EVCTRL_RESRDYEO_Msk & (_UINT32_(value) << ADC_EVCTRL_RESRDYEO_Pos)) /* Assignment of value for RESRDYEO in the ADC_EVCTRL register */
#define ADC_EVCTRL_SAMPRDYEO_Pos              _UINT32_(9)                                          /* (ADC_EVCTRL) Sample Ready Event Output Enable Position */
#define ADC_EVCTRL_SAMPRDYEO_Msk              (_UINT32_(0x1) << ADC_EVCTRL_SAMPRDYEO_Pos)          /* (ADC_EVCTRL) Sample Ready Event Output Enable Mask */
#define ADC_EVCTRL_SAMPRDYEO(value)           (ADC_EVCTRL_SAMPRDYEO_Msk & (_UINT32_(value) << ADC_EVCTRL_SAMPRDYEO_Pos)) /* Assignment of value for SAMPRDYEO in the ADC_EVCTRL register */
#define ADC_EVCTRL_WCMPEO_Pos                 _UINT32_(10)                                         /* (ADC_EVCTRL) Window Comparator Event Output Enable Position */
#define ADC_EVCTRL_WCMPEO_Msk                 (_UINT32_(0x1) << ADC_EVCTRL_WCMPEO_Pos)             /* (ADC_EVCTRL) Window Comparator Event Output Enable Mask */
#define ADC_EVCTRL_WCMPEO(value)              (ADC_EVCTRL_WCMPEO_Msk & (_UINT32_(value) << ADC_EVCTRL_WCMPEO_Pos)) /* Assignment of value for WCMPEO in the ADC_EVCTRL register */
#define ADC_EVCTRL_Msk                        _UINT32_(0x00000711)                                 /* (ADC_EVCTRL) Register Mask  */


