Microchip-MPLAB-Harmony/touch_apps/apps/onboard_sensor/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/adc.h
/* -------- ADC_INTENCLR : (ADC Offset: 0x30) (R/W 32) Interrupt Enable Clear -------- */
#define ADC_INTENCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (ADC_INTENCLR) Interrupt Enable Clear  Reset Value */

#define ADC_INTENCLR_RESRDY_Pos               _UINT32_(0)                                          /* (ADC_INTENCLR) Result Ready Interrupt Enable Position */
#define ADC_INTENCLR_RESRDY_Msk               (_UINT32_(0x1) << ADC_INTENCLR_RESRDY_Pos)           /* (ADC_INTENCLR) Result Ready Interrupt Enable Mask */
#define ADC_INTENCLR_RESRDY(value)            (ADC_INTENCLR_RESRDY_Msk & (_UINT32_(value) << ADC_INTENCLR_RESRDY_Pos)) /* Assignment of value for RESRDY in the ADC_INTENCLR register */
#define ADC_INTENCLR_SAMPRDY_Pos              _UINT32_(1)                                          /* (ADC_INTENCLR) Sample Ready Interrupt Enable Position */
#define ADC_INTENCLR_SAMPRDY_Msk              (_UINT32_(0x1) << ADC_INTENCLR_SAMPRDY_Pos)          /* (ADC_INTENCLR) Sample Ready Interrupt Enable Mask */
#define ADC_INTENCLR_SAMPRDY(value)           (ADC_INTENCLR_SAMPRDY_Msk & (_UINT32_(value) << ADC_INTENCLR_SAMPRDY_Pos)) /* Assignment of value for SAMPRDY in the ADC_INTENCLR register */
#define ADC_INTENCLR_WCMP_Pos                 _UINT32_(2)                                          /* (ADC_INTENCLR) Window Comparator Interrupt Enable Position */
#define ADC_INTENCLR_WCMP_Msk                 (_UINT32_(0x1) << ADC_INTENCLR_WCMP_Pos)             /* (ADC_INTENCLR) Window Comparator Interrupt Enable Mask */
#define ADC_INTENCLR_WCMP(value)              (ADC_INTENCLR_WCMP_Msk & (_UINT32_(value) << ADC_INTENCLR_WCMP_Pos)) /* Assignment of value for WCMP in the ADC_INTENCLR register */
#define ADC_INTENCLR_RESOVR_Pos               _UINT32_(3)                                          /* (ADC_INTENCLR) Result Overwrite Interrupt Enable Position */
#define ADC_INTENCLR_RESOVR_Msk               (_UINT32_(0x1) << ADC_INTENCLR_RESOVR_Pos)           /* (ADC_INTENCLR) Result Overwrite Interrupt Enable Mask */
#define ADC_INTENCLR_RESOVR(value)            (ADC_INTENCLR_RESOVR_Msk & (_UINT32_(value) << ADC_INTENCLR_RESOVR_Pos)) /* Assignment of value for RESOVR in the ADC_INTENCLR register */
#define ADC_INTENCLR_SAMPOVR_Pos              _UINT32_(4)                                          /* (ADC_INTENCLR) Sample Overwrite Interrupt Enable Position */
#define ADC_INTENCLR_SAMPOVR_Msk              (_UINT32_(0x1) << ADC_INTENCLR_SAMPOVR_Pos)          /* (ADC_INTENCLR) Sample Overwrite Interrupt Enable Mask */
#define ADC_INTENCLR_SAMPOVR(value)           (ADC_INTENCLR_SAMPOVR_Msk & (_UINT32_(value) << ADC_INTENCLR_SAMPOVR_Pos)) /* Assignment of value for SAMPOVR in the ADC_INTENCLR register */
#define ADC_INTENCLR_TRIGOVR_Pos              _UINT32_(5)                                          /* (ADC_INTENCLR) Trigger Overrun Interrupt Enable Position */
#define ADC_INTENCLR_TRIGOVR_Msk              (_UINT32_(0x1) << ADC_INTENCLR_TRIGOVR_Pos)          /* (ADC_INTENCLR) Trigger Overrun Interrupt Enable Mask */
#define ADC_INTENCLR_TRIGOVR(value)           (ADC_INTENCLR_TRIGOVR_Msk & (_UINT32_(value) << ADC_INTENCLR_TRIGOVR_Pos)) /* Assignment of value for TRIGOVR in the ADC_INTENCLR register */
#define ADC_INTENCLR_Msk                      _UINT32_(0x0000003F)                                 /* (ADC_INTENCLR) Register Mask  */


/* -------- ADC_INTENSET : (ADC Offset: 0x34) (R/W 32) Interrupt Enable Set -------- */
#define ADC_INTENSET_RESETVALUE               _UINT32_(0x00)                                       /*  (ADC_INTENSET) Interrupt Enable Set  Reset Value */

#define ADC_INTENSET_RESRDY_Pos               _UINT32_(0)                                          /* (ADC_INTENSET) Result Ready Interrupt Enable Position */
#define ADC_INTENSET_RESRDY_Msk               (_UINT32_(0x1) << ADC_INTENSET_RESRDY_Pos)           /* (ADC_INTENSET) Result Ready Interrupt Enable Mask */
#define ADC_INTENSET_RESRDY(value)            (ADC_INTENSET_RESRDY_Msk & (_UINT32_(value) << ADC_INTENSET_RESRDY_Pos)) /* Assignment of value for RESRDY in the ADC_INTENSET register */
#define ADC_INTENSET_SAMPRDY_Pos              _UINT32_(1)                                          /* (ADC_INTENSET) Sample Ready Interrupt Enable Position */
#define ADC_INTENSET_SAMPRDY_Msk              (_UINT32_(0x1) << ADC_INTENSET_SAMPRDY_Pos)          /* (ADC_INTENSET) Sample Ready Interrupt Enable Mask */
#define ADC_INTENSET_SAMPRDY(value)           (ADC_INTENSET_SAMPRDY_Msk & (_UINT32_(value) << ADC_INTENSET_SAMPRDY_Pos)) /* Assignment of value for SAMPRDY in the ADC_INTENSET register */
#define ADC_INTENSET_WCMP_Pos                 _UINT32_(2)                                          /* (ADC_INTENSET) Window Comparator Interrupt Enable Position */
#define ADC_INTENSET_WCMP_Msk                 (_UINT32_(0x1) << ADC_INTENSET_WCMP_Pos)             /* (ADC_INTENSET) Window Comparator Interrupt Enable Mask */
#define ADC_INTENSET_WCMP(value)              (ADC_INTENSET_WCMP_Msk & (_UINT32_(value) << ADC_INTENSET_WCMP_Pos)) /* Assignment of value for WCMP in the ADC_INTENSET register */
#define ADC_INTENSET_RESOVR_Pos               _UINT32_(3)                                          /* (ADC_INTENSET) Result Overwrite Interrupt Enable Position */
#define ADC_INTENSET_RESOVR_Msk               (_UINT32_(0x1) << ADC_INTENSET_RESOVR_Pos)           /* (ADC_INTENSET) Result Overwrite Interrupt Enable Mask */
#define ADC_INTENSET_RESOVR(value)            (ADC_INTENSET_RESOVR_Msk & (_UINT32_(value) << ADC_INTENSET_RESOVR_Pos)) /* Assignment of value for RESOVR in the ADC_INTENSET register */
#define ADC_INTENSET_SAMPOVR_Pos              _UINT32_(4)                                          /* (ADC_INTENSET) Sample Overwrite Interrupt Enable Position */
#define ADC_INTENSET_SAMPOVR_Msk              (_UINT32_(0x1) << ADC_INTENSET_SAMPOVR_Pos)          /* (ADC_INTENSET) Sample Overwrite Interrupt Enable Mask */
#define ADC_INTENSET_SAMPOVR(value)           (ADC_INTENSET_SAMPOVR_Msk & (_UINT32_(value) << ADC_INTENSET_SAMPOVR_Pos)) /* Assignment of value for SAMPOVR in the ADC_INTENSET register */
#define ADC_INTENSET_TRIGOVR_Pos              _UINT32_(5)                                          /* (ADC_INTENSET) Trigger Overrun Interrupt Enable Position */
#define ADC_INTENSET_TRIGOVR_Msk              (_UINT32_(0x1) << ADC_INTENSET_TRIGOVR_Pos)          /* (ADC_INTENSET) Trigger Overrun Interrupt Enable Mask */
#define ADC_INTENSET_TRIGOVR(value)           (ADC_INTENSET_TRIGOVR_Msk & (_UINT32_(value) << ADC_INTENSET_TRIGOVR_Pos)) /* Assignment of value for TRIGOVR in the ADC_INTENSET register */
#define ADC_INTENSET_Msk                      _UINT32_(0x0000003F)                                 /* (ADC_INTENSET) Register Mask  */


/* -------- ADC_INTFLAG : (ADC Offset: 0x38) (R/W 32) Interrupt Flag Status and Clear -------- */
#define ADC_INTFLAG_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define ADC_INTFLAG_RESRDY_Pos                _UINT32_(0)                                          /* (ADC_INTFLAG) Result Ready Interrupt Flag Position */
#define ADC_INTFLAG_RESRDY_Msk                (_UINT32_(0x1) << ADC_INTFLAG_RESRDY_Pos)            /* (ADC_INTFLAG) Result Ready Interrupt Flag Mask */
#define ADC_INTFLAG_RESRDY(value)             (ADC_INTFLAG_RESRDY_Msk & (_UINT32_(value) << ADC_INTFLAG_RESRDY_Pos)) /* Assignment of value for RESRDY in the ADC_INTFLAG register */
#define ADC_INTFLAG_SAMPRDY_Pos               _UINT32_(1)                                          /* (ADC_INTFLAG) Sample Ready Interrupt Flag Position */
#define ADC_INTFLAG_SAMPRDY_Msk               (_UINT32_(0x1) << ADC_INTFLAG_SAMPRDY_Pos)           /* (ADC_INTFLAG) Sample Ready Interrupt Flag Mask */
#define ADC_INTFLAG_SAMPRDY(value)            (ADC_INTFLAG_SAMPRDY_Msk & (_UINT32_(value) << ADC_INTFLAG_SAMPRDY_Pos)) /* Assignment of value for SAMPRDY in the ADC_INTFLAG register */
#define ADC_INTFLAG_WCMP_Pos                  _UINT32_(2)                                          /* (ADC_INTFLAG) Window Comparator Interrupt Flag Position */
#define ADC_INTFLAG_WCMP_Msk                  (_UINT32_(0x1) << ADC_INTFLAG_WCMP_Pos)              /* (ADC_INTFLAG) Window Comparator Interrupt Flag Mask */
#define ADC_INTFLAG_WCMP(value)               (ADC_INTFLAG_WCMP_Msk & (_UINT32_(value) << ADC_INTFLAG_WCMP_Pos)) /* Assignment of value for WCMP in the ADC_INTFLAG register */
#define ADC_INTFLAG_RESOVR_Pos                _UINT32_(3)                                          /* (ADC_INTFLAG) Result Overwrite Interrupt Flag Position */
#define ADC_INTFLAG_RESOVR_Msk                (_UINT32_(0x1) << ADC_INTFLAG_RESOVR_Pos)            /* (ADC_INTFLAG) Result Overwrite Interrupt Flag Mask */
#define ADC_INTFLAG_RESOVR(value)             (ADC_INTFLAG_RESOVR_Msk & (_UINT32_(value) << ADC_INTFLAG_RESOVR_Pos)) /* Assignment of value for RESOVR in the ADC_INTFLAG register */
#define ADC_INTFLAG_SAMPOVR_Pos               _UINT32_(4)                                          /* (ADC_INTFLAG) Sample Overwrite Interrupt Flag Position */
#define ADC_INTFLAG_SAMPOVR_Msk               (_UINT32_(0x1) << ADC_INTFLAG_SAMPOVR_Pos)           /* (ADC_INTFLAG) Sample Overwrite Interrupt Flag Mask */
#define ADC_INTFLAG_SAMPOVR(value)            (ADC_INTFLAG_SAMPOVR_Msk & (_UINT32_(value) << ADC_INTFLAG_SAMPOVR_Pos)) /* Assignment of value for SAMPOVR in the ADC_INTFLAG register */
#define ADC_INTFLAG_TRIGOVR_Pos               _UINT32_(5)                                          /* (ADC_INTFLAG) Trigger Overrun Interrupt Flag Position */
#define ADC_INTFLAG_TRIGOVR_Msk               (_UINT32_(0x1) << ADC_INTFLAG_TRIGOVR_Pos)           /* (ADC_INTFLAG) Trigger Overrun Interrupt Flag Mask */
#define ADC_INTFLAG_TRIGOVR(value)            (ADC_INTFLAG_TRIGOVR_Msk & (_UINT32_(value) << ADC_INTFLAG_TRIGOVR_Pos)) /* Assignment of value for TRIGOVR in the ADC_INTFLAG register */
#define ADC_INTFLAG_Msk                       _UINT32_(0x0000003F)                                 /* (ADC_INTFLAG) Register Mask  */


/* -------- ADC_INTFLAGSET : (ADC Offset: 0x3C) (R/W 32) Interrupt Flag Set -------- */
#define ADC_INTFLAGSET_RESETVALUE             _UINT32_(0x00)                                       /*  (ADC_INTFLAGSET) Interrupt Flag Set  Reset Value */

#define ADC_INTFLAGSET_RESRDY_Pos             _UINT32_(0)                                          /* (ADC_INTFLAGSET) Result Ready Interrupt Flag Position */
#define ADC_INTFLAGSET_RESRDY_Msk             (_UINT32_(0x1) << ADC_INTFLAGSET_RESRDY_Pos)         /* (ADC_INTFLAGSET) Result Ready Interrupt Flag Mask */
#define ADC_INTFLAGSET_RESRDY(value)          (ADC_INTFLAGSET_RESRDY_Msk & (_UINT32_(value) << ADC_INTFLAGSET_RESRDY_Pos)) /* Assignment of value for RESRDY in the ADC_INTFLAGSET register */
#define ADC_INTFLAGSET_SAMPRDY_Pos            _UINT32_(1)                                          /* (ADC_INTFLAGSET) Sample Ready Interrupt Flag Position */
#define ADC_INTFLAGSET_SAMPRDY_Msk            (_UINT32_(0x1) << ADC_INTFLAGSET_SAMPRDY_Pos)        /* (ADC_INTFLAGSET) Sample Ready Interrupt Flag Mask */
#define ADC_INTFLAGSET_SAMPRDY(value)         (ADC_INTFLAGSET_SAMPRDY_Msk & (_UINT32_(value) << ADC_INTFLAGSET_SAMPRDY_Pos)) /* Assignment of value for SAMPRDY in the ADC_INTFLAGSET register */
#define ADC_INTFLAGSET_WCMP_Pos               _UINT32_(2)                                          /* (ADC_INTFLAGSET) Window Comparator Interrupt Flag Position */
#define ADC_INTFLAGSET_WCMP_Msk               (_UINT32_(0x1) << ADC_INTFLAGSET_WCMP_Pos)           /* (ADC_INTFLAGSET) Window Comparator Interrupt Flag Mask */
#define ADC_INTFLAGSET_WCMP(value)            (ADC_INTFLAGSET_WCMP_Msk & (_UINT32_(value) << ADC_INTFLAGSET_WCMP_Pos)) /* Assignment of value for WCMP in the ADC_INTFLAGSET register */
#define ADC_INTFLAGSET_RESOVR_Pos             _UINT32_(3)                                          /* (ADC_INTFLAGSET) Result Overwrite Interrupt Flag Position */
#define ADC_INTFLAGSET_RESOVR_Msk             (_UINT32_(0x1) << ADC_INTFLAGSET_RESOVR_Pos)         /* (ADC_INTFLAGSET) Result Overwrite Interrupt Flag Mask */
#define ADC_INTFLAGSET_RESOVR(value)          (ADC_INTFLAGSET_RESOVR_Msk & (_UINT32_(value) << ADC_INTFLAGSET_RESOVR_Pos)) /* Assignment of value for RESOVR in the ADC_INTFLAGSET register */
#define ADC_INTFLAGSET_SAMPOVR_Pos            _UINT32_(4)                                          /* (ADC_INTFLAGSET) Sample Overwrite Interrupt Flag Position */
#define ADC_INTFLAGSET_SAMPOVR_Msk            (_UINT32_(0x1) << ADC_INTFLAGSET_SAMPOVR_Pos)        /* (ADC_INTFLAGSET) Sample Overwrite Interrupt Flag Mask */
#define ADC_INTFLAGSET_SAMPOVR(value)         (ADC_INTFLAGSET_SAMPOVR_Msk & (_UINT32_(value) << ADC_INTFLAGSET_SAMPOVR_Pos)) /* Assignment of value for SAMPOVR in the ADC_INTFLAGSET register */
#define ADC_INTFLAGSET_TRIGOVR_Pos            _UINT32_(5)                                          /* (ADC_INTFLAGSET) Trigger Overrun Interrupt Flag Position */
#define ADC_INTFLAGSET_TRIGOVR_Msk            (_UINT32_(0x1) << ADC_INTFLAGSET_TRIGOVR_Pos)        /* (ADC_INTFLAGSET) Trigger Overrun Interrupt Flag Mask */
#define ADC_INTFLAGSET_TRIGOVR(value)         (ADC_INTFLAGSET_TRIGOVR_Msk & (_UINT32_(value) << ADC_INTFLAGSET_TRIGOVR_Pos)) /* Assignment of value for TRIGOVR in the ADC_INTFLAGSET register */
#define ADC_INTFLAGSET_Msk                    _UINT32_(0x0000003F)                                 /* (ADC_INTFLAGSET) Register Mask  */


/* -------- ADC_STATUS : (ADC Offset: 0x40) ( R/ 32) Status -------- */
#define ADC_STATUS_RESETVALUE                 _UINT32_(0x00)                                       /*  (ADC_STATUS) Status  Reset Value */

